# 2. Выполнить логические побитовые операции "И", "ИЛИ" и др.
# над числами 5 и 6. Выполнить
# над числом 5 побитовый сдвиг вправо и влево на два знака.

print(f"Побитовая операция И над числами 5 и 6: (5 & 6) = {5 & 6}")
print(f"Побитовая операция ИЛИ над числами 5 и 6: (5 | 6) = {5 | 6}")
print(f"Побитовая операция исключительное ИЛИ над числами 5 и 6: (5 ^ 6) = {5 ^ 6}")

print(f"Побитовый сдвиг влево над числом 5 на два знака: (5 << 2) = {5 << 2}")
print(f"Побитовый сдвиг вправо над числом 5 на два знака: (5 >> 2) = {5 >> 2}")
